mvp-2/src/scripts/load-test/artillery-smoke.yml
# Smoke test — 1 usuário por 30 segundos
# Verifica que os endpoints principais respondem sem erros antes do teste completo.
# Uso: npm run load:smoke

config:
  target: "http://localhost:3000"
  processor: "./artillery-processor.js"

  plugins:
    expect: {}

  phases:
    - name: "Smoke — 1 usuário por 30s"
      duration: 30
      arrivalRate: 1

  http:
    timeout: 30

scenarios:
  - name: "Fluxo Aluno — login + /me + dashboard"
    weight: 3
    beforeScenario: "definirVariaveis"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email_aluno }}"
            senha: "{{ senha_aluno }}"
          capture:
            - json: "$.token"
              as: "token"
            - json: "$.usuario.jovem_id"
              as: "jovem_id"
          expect:
            - statusCode: 200
      - think: 0.5
      - get:
          url: "/api/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/dashboard/aluno/{{ jovem_id }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Fluxo Mentor — login + dashboard"
    weight: 2
    beforeScenario: "definirVariaveis"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email_mentor }}"
            senha: "{{ senha_mentor }}"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 200
      - think: 0.5
      - get:
          url: "/api/dashboard/mentor"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Fluxo Gestão — login + KPIs + jovens em risco"
    weight: 2
    beforeScenario: "definirVariaveis"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email_gestao }}"
            senha: "{{ senha_gestao }}"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 200
      - think: 0.5
      - get:
          url: "/api/dashboard"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/dashboard/jovens-em-risco"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200